### Day-1 for learning Pandas

In [1]:
import pandas as pd

#### Adding dataset in pandas

In [2]:
data = {
    'ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Name': ['Ankit Sharma', 'Priya Verma', 'Rahul Mehta', 'Neha Singh', 'Arjun Patel', 
             'Sneha Kapoor', 'Manish Gupta', 'Riya Malhotra', 'Karan Johar', 'Simran Kaur'],
    'Salary': [85000, 65000, 72000, 78000, 90000, 68000, 95000, 70000, 82000, 88000],
    'Role': ['Data Scientist', 'Software Developer', 'System Administrator', 'DevOps Engineer', 
             'Cloud Architect', 'QA Engineer', 'Machine Learning Engineer', 'Frontend Developer', 
             'Backend Developer', 'Database Administrator']
}

#### Printing dataset by making dataframe(df)

In [3]:
df=pd.DataFrame(data)
df

    ID           Name  Salary                       Role
0  101   Ankit Sharma   85000             Data Scientist
1  102    Priya Verma   65000         Software Developer
2  103    Rahul Mehta   72000       System Administrator
3  104     Neha Singh   78000            DevOps Engineer
4  105    Arjun Patel   90000            Cloud Architect
5  106   Sneha Kapoor   68000                QA Engineer
6  107   Manish Gupta   95000  Machine Learning Engineer
7  108  Riya Malhotra   70000         Frontend Developer
8  109    Karan Johar   82000          Backend Developer
9  110    Simran Kaur   88000     Database Administrator

#### Insertiong a new col [bonus]

In [4]:
df['Bonus']=df['Salary']*.01

#### Inserting total col

In [5]:
print(df)
df['total']=df['Salary']+df['Bonus']
print("After adding column")
print(df)

    ID           Name  Salary                       Role  Bonus
0  101   Ankit Sharma   85000             Data Scientist  850.0
1  102    Priya Verma   65000         Software Developer  650.0
2  103    Rahul Mehta   72000       System Administrator  720.0
3  104     Neha Singh   78000            DevOps Engineer  780.0
4  105    Arjun Patel   90000            Cloud Architect  900.0
5  106   Sneha Kapoor   68000                QA Engineer  680.0
6  107   Manish Gupta   95000  Machine Learning Engineer  950.0
7  108  Riya Malhotra   70000         Frontend Developer  700.0
8  109    Karan Johar   82000          Backend Developer  820.0
9  110    Simran Kaur   88000     Database Administrator  880.0
After adding column
    ID           Name  Salary                       Role  Bonus    total
0  101   Ankit Sharma   85000             Data Scientist  850.0  85850.0
1  102    Priya Verma   65000         Software Developer  650.0  65650.0
2  103    Rahul Mehta   72000       System Administrator  720.0  72720.0
3  104     Neha Singh   78000            DevOps Engineer  780.0  78780.0
4  105    Arjun Patel   90000            Cloud Architect  900.0  90900.0
5  106   Sneha Kapoor   68000                QA Engineer  680.0  68680.0
6  107   Manish Gupta   95000  Machine Learning Engineer  950.0  95950.0
7  108  Riya Malhotra   70000         Frontend Developer  700.0  70700.0
8  109    Karan Johar   82000          Backend Developer  820.0  82820.0
9  110    Simran Kaur   88000     Database Administrator  880.0  88880.0

### Insert by using insert() method

In [6]:
df.insert(0,'Gender','M')
df

,Gender,ID,Name,Salary,Role,Bonus,total
0,M,101,Ankit Sharma,85000,Data Scientist,850.0,85850.0
1,M,102,Priya Verma,65000,Software Developer,650.0,65650.0
2,M,103,Rahul Mehta,72000,System Administrator,720.0,72720.0
3,M,104,Neha Singh,78000,DevOps Engineer,780.0,78780.0
4,M,105,Arjun Patel,90000,Cloud Architect,900.0,90900.0
5,M,106,Sneha Kapoor,68000,QA Engineer,680.0,68680.0
6,M,107,Manish Gupta,95000,Machine Learning Engineer,950.0,95950.0
7,M,108,Riya Malhotra,70000,Frontend Developer,700.0,70700.0
8,M,109,Karan Johar,82000,Backend Developer,820.0,82820.0
9,M,110,Simran Kaur,88000,Database Administrator,880.0,88880.0

### Using function head and tail

In [7]:
print("Head part")
print(df.head())
print("Tail part")
print(df.tail())

Head part
  Gender   ID          Name  Salary                  Role  Bonus    total
0      M  101  Ankit Sharma   85000        Data Scientist  850.0  85850.0
1      M  102   Priya Verma   65000    Software Developer  650.0  65650.0
2      M  103   Rahul Mehta   72000  System Administrator  720.0  72720.0
3      M  104    Neha Singh   78000       DevOps Engineer  780.0  78780.0
4      M  105   Arjun Patel   90000       Cloud Architect  900.0  90900.0
Tail part
  Gender   ID           Name  Salary                       Role  Bonus  \
5      M  106   Sneha Kapoor   68000                QA Engineer  680.0
6      M  107   Manish Gupta   95000  Machine Learning Engineer  950.0
7      M  108  Riya Malhotra   70000         Frontend Developer  700.0
8      M  109    Karan Johar   82000          Backend Developer  820.0
9      M  110    Simran Kaur   88000     Database Administrator  880.0

     total
5  68680.0
6  95950.0
7  70700.0
8  82820.0
9  88880.0

### Shape and columns

In [8]:
print("Shape of dataframe or dataset:")
print(df.shape)
print("Returns columns name:")
print(df.columns)

Shape of dataframe or dataset:
(10, 7)
Returns columns name:
Index(['Gender', 'ID', 'Name', 'Salary', 'Role', 'Bonus', 'total'], dtype='object')

#### Describe and info method

In [9]:
print("Describe Method")
print(df.describe())
print("Info Method")
print(df.info())

Describe Method
              ID        Salary       Bonus         total
count   10.00000     10.000000   10.000000     10.000000
mean   105.50000  79300.000000  793.000000  80093.000000
std      3.02765  10274.564062  102.745641  10377.309703
min    101.00000  65000.000000  650.000000  65650.000000
25%    103.25000  70500.000000  705.000000  71205.000000
50%    105.50000  80000.000000  800.000000  80800.000000
75%    107.75000  87250.000000  872.500000  88122.500000
max    110.00000  95000.000000  950.000000  95950.000000
Info Method
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Gender  10 non-null     object
 1   ID      10 non-null     int64
 2   Name    10 non-null     object
 3   Salary  10 non-null     int64
 4   Role    10 non-null     object
 5   Bonus   10 non-null     float64
 6   total   10 non-null     float64
dtypes: float64(2), int64(2), object(3)
memory usage: 692.0+ bytes
None

#### AND and OR Clause

In [10]:
print("Using AND caluse")
And=df[(df['Salary']>80000) & (df['total']>=90000)]
print(And)
print("Using OR Clause")
Or=df[(df['Salary']>80000)| (df['total']>=90000)]
print(Or)

Using AND caluse
  Gender   ID          Name  Salary                       Role  Bonus    total
4      M  105   Arjun Patel   90000            Cloud Architect  900.0  90900.0
6      M  107  Manish Gupta   95000  Machine Learning Engineer  950.0  95950.0
Using OR Clause
  Gender   ID          Name  Salary                       Role  Bonus    total
0      M  101  Ankit Sharma   85000             Data Scientist  850.0  85850.0
4      M  105   Arjun Patel   90000            Cloud Architect  900.0  90900.0
6      M  107  Manish Gupta   95000  Machine Learning Engineer  950.0  95950.0
8      M  109   Karan Johar   82000          Backend Developer  820.0  82820.0
9      M  110   Simran Kaur   88000     Database Administrator  880.0  88880.0

# Today Task is complete